{
  "_name_or_path": "cointegrated/rubert-tiny",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "O",
    "1": "B-\u0414\u0430\u0442\u0430",
    "2": "B-\u0431\u0440\u0435\u043d\u0434",
    "3": "B-\u0432\u0438\u0434 \u0441\u043f\u043e\u0440\u0442\u0430",
    "4": "B-\u0432\u0438\u0434\u0435\u043e\u0438\u0433\u0440\u0430",
    "5": "B-\u043a\u043e\u043c\u0430\u043d\u0434\u0430",
    "6": "B-\u043b\u0438\u0433\u0430",
    "7": "B-\u043b\u043e\u043a\u0430\u0446\u0438\u044f",
    "8": "B-\u043c\u043e\u0434\u0435\u043b\u044c",
    "9": "B-\u043d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u043f\u0440\u043e\u0435\u043a\u0442\u0430",
    "10": "B-\u043e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u044f",
    "11": "B-\u043f\u0435\u0440\u0441\u043e\u043d\u0430",
    "12": "B-\u0441\u0435\u0437\u043e\u043d",
    "13": "B-\u0441\u0435\u0440\u0438\u044f",
    "14": "I-\u0414\u0430\u0442\u0430",
    "15": "I-\u0431\u0440\u0435\u043d\u0434",
    "16": "I-\u0432\u0438\u0434 \u0441\u043f\u043e\u0440\u0442\u0430",
    "17": "I-\u0432\u0438\u0434\u0435\u043e\u0438\u0433\u0440\u0430",
    "18": "I-\u043a\u043e\u043c\u0430\u043d\u0434\u0430",
    "19": "I-\u043b\u0438\u0433\u0430",
    "20": "I-\u043b\u043e\u043a\u0430\u0446\u0438\u044f",
    "21": "I-\u043c\u043e\u0434\u0435\u043b\u044c",
    "22": "I-\u043d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u043f\u0440\u043e\u0435\u043a\u0442\u0430",
    "23": "I-\u043e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u044f",
    "24": "I-\u043f\u0435\u0440\u0441\u043e\u043d\u0430",
    "25": "I-\u0441\u0435\u0437\u043e\u043d",
    "26": "I-\u0441\u0435\u0440\u0438\u044f"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "B-\u0414\u0430\u0442\u0430": 1,
    "B-\u0431\u0440\u0435\u043d\u0434": 2,
    "B-\u0432\u0438\u0434 \u0441\u043f\u043e\u0440\u0442\u0430": 3,
    "B-\u0432\u0438\u0434\u0435\u043e\u0438\u0433\u0440\u0430": 4,
    "B-\u043a\u043e\u043c\u0430\u043d\u0434\u0430": 5,
    "B-\u043b\u0438\u0433\u0430": 6,
    "B-\u043b\u043e\u043a\u0430\u0446\u0438\u044f": 7,
    "B-\u043c\u043e\u0434\u0435\u043b\u044c": 8,
    "B-\u043d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u043f\u0440\u043e\u0435\u043a\u0442\u0430": 9,
    "B-\u043e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u044f": 10,
    "B-\u043f\u0435\u0440\u0441\u043e\u043d\u0430": 11,
    "B-\u0441\u0435\u0437\u043e\u043d": 12,
    "B-\u0441\u0435\u0440\u0438\u044f": 13,
    "I-\u0414\u0430\u0442\u0430": 14,
    "I-\u0431\u0440\u0435\u043d\u0434": 15,
    "I-\u0432\u0438\u0434 \u0441\u043f\u043e\u0440\u0442\u0430": 16,
    "I-\u0432\u0438\u0434\u0435\u043e\u0438\u0433\u0440\u0430": 17,
    "I-\u043a\u043e\u043c\u0430\u043d\u0434\u0430": 18,
    "I-\u043b\u0438\u0433\u0430": 19,
    "I-\u043b\u043e\u043a\u0430\u0446\u0438\u044f": 20,
    "I-\u043c\u043e\u0434\u0435\u043b\u044c": 21,
    "I-\u043d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u043f\u0440\u043e\u0435\u043a\u0442\u0430": 22,
    "I-\u043e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u044f": 23,
    "I-\u043f\u0435\u0440\u0441\u043e\u043d\u0430": 24,
    "I-\u0441\u0435\u0437\u043e\u043d": 25,
    "I-\u0441\u0435\u0440\u0438\u044f": 26,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.34.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29564
}
